import 'dart:ffi';

import 'package:bloc/bloc.dart';
import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';
import 'package:flutter_bloc/flutter_bloc.dart';

import 'constraint_status.dart';

class ConstraintCubit extends Cubit<ConstraintStatues> {
  ConstraintCubit() : super(ConstrainInitState());

  static ConstraintCubit get(BuildContext context) {
    return BlocProvider.of(context);
  }

  String textTitle = 'خطوات التقديم :';
  String text1 =
      '١ - يجب على الطالب/ة إدخال البيانات الشخصية و الجامعية بشكل صحيح';
  String text2 =
      '٢ - تقديم طلب الإلتحاق بالمدينة الجامعية يكون خلال فترة التقديم فقط';
  String text3 = '٣ - غير مسموح التقديم بعد المواعيد المقررة للتقدي';
  String text4 = '٤ - بعد أن يستوفى الطالب/ة البيانات يقوم بطباعة الطلب';
  String text5 =
      '٥ -يمكن للطالب/ة متابعة طلب الإلتحاق الخاص به برقمه القومى عن طريق الدخول على رابط الإستعلام عن القبول بالمدينة الجامعية';
  String text6 =
      '٦ - يستطيع الطالب/ة تعديل بياناته على الموقع برقمه القومى وكلمة المرور الخاصة به وذلك من خلال تعديل بيانات طلب الإلتحاق مع الأخذ فى الإعتبار أنه بمجرد انتهاء فترة التسجيل أو بعد مراجعة طلب الإلتحاق وقبول طلبه لن يستطيع الطالب/ة الدخول على هذه الخاصية';

  void constraint() {
    textTitle = 'خطوات التقديم :';
    text1 = '١ - يجب على الطالب/ة إدخال البيانات الشخصية و الجامعية بشكل صحيح';
    text2 =
    '٢ - تقديم طلب الإلتحاق بالمدينة الجامعية يكون خلال فترة التقديم فقط';
    text3 = '٣ - غير مسموح التقديم بعد المواعيد المقررة للتقدي';
    text4 = '٤ - بعد أن يستوفى الطالب/ة البيانات يقوم بطباعة الطلب';
    text5 =
    '٥ -يمكن للطالب/ة متابعة طلب الإلتحاق الخاص به برقمه القومى عن طريق الدخول على رابط الإستعلام عن القبول بالمدينة الجامعية';
    text6 =
    '٦ - يستطيع الطالب/ة تعديل بياناته على الموقع برقمه القومى وكلمة المرور الخاصة به وذلك من خلال تعديل بيانات طلب الإلتحاق مع الأخذ فى الإعتبار أنه بمجرد انتهاء فترة التسجيل أو بعد مراجعة طلب الإلتحاق وقبول طلبه لن يستطيع الطالب/ة الدخول على هذه الخاصية';

    emit(ChangeText1());
  }

  void changeTextOldStudent() {
    textTitle = 'أوراق الطالب القديم :';
    text1 = '١ - استمارة الالتحاق معتمدة ومختومة من الكلية';
    text2 = '٢ - صورة الاشعار الاليكترونى';
    text3 = '٣ - عدد 3 صورة من بطاقة الرقم القومى';
    text4 = '٤ - عدد 3 صورة من بطاقة الرقم القومى لولى الامر سارية';
    text5 = '٥ - عدد 12 صورة ضوئية حديثة';
    text6 =
    '* ملحوظة : حالة وجود ولى أمر غير الوالد يتقدم الطالب بتقديم صورة من مستند يوضح السبب( شهادة وفاة – انفصال والدين)ة';

    emit(ChangeText1());
  }

  void ChangeToNewStudent() {
    textTitle = 'أوراق الطالب المستجد :';
    text1 = '١ - استمارة الالتحاق معتمدة ومختومة من الكلية';
    text2 = '٢ - عدد2 صورة من بطاقة ترشيح الثانوية العامة';
    text3 = '٣ - صورة الاشعار الاليكترونى';
    text4 = '٤ - عدد 3 صورة من بطاقة الرقم القومى للطالب سارية';
    text5 = '٥ - عدد 3 صورة من بطاقة الرقم القومى لولى الامر سارية';
    text6 =
    '٦ - عدد 12 صورة  ضوئية حديثة\n * ملحوظة : وفى حالة وجود ولى أمر غير الوالد يتقدم الطالب بتقديم صورة من مستند يوضح السبب( شهادة وفاة – انفصال والدين)  ';
    emit(ChangeText2());
  }
}